{
  "componentName": "AzureTranslation",
  "componentVersion": "9.0",
  "middlewareVersion": "9.0",
  "sourceLanguage": "python",
  "batchLibrary": "AzureTranslation",
  "environmentVariables": [],
  "algorithm": {
    "name": "AZURETRANSLATION",
    "description": "Uses Azure Cognitive Services to perform translation.",
    "actionType": "DETECTION",
    "trackType": "TRANSLATION",
    "outputChangedCounter": 1,
    "requiresCollection": {
      "states": []
    },
    "providesCollection": {
      "states": [
        "DETECTION",
        "DETECTION_TRANSLATION",
        "DETECTION_TRANSLATION_AZURE"
      ],
      "properties": [
        {
          "name": "ACS_URL",
          "description": "Base URL for the Azure Cognitive Services Endpoint. e.g. https://api.cognitive.microsofttranslator.com . Can also be provided by an environment variable with the same name. If both are provided, the job property is used. Note that the component was only tested against v3.0 of the API.",
          "type": "STRING",
          "defaultValue": ""
        },
        {
          "name": "ACS_SUBSCRIPTION_KEY",
          "description": "Azure Cognitive Services subscription key. Can also be provided by an environment variable with the same name. If both are provided, the job property is used.",
          "type": "STRING",
          "defaultValue": ""
        },
        {
          "name": "FEED_FORWARD_PROP_TO_PROCESS",
          "description": "Comma-separated list of property names indicating which properties in the feed-forward track or detection to consider translating. If the first property listed is present, then that property will be translated. If it's not, then the next property in the list is considered. At most, one property will be translated.",
          "type": "STRING",
          "defaultValue": "TEXT,TRANSCRIPT"
        },
        {
          "name": "TO_LANGUAGE",
          "description": "The BCP-47 language code for language that the properties should be translated to. Please consult README to query Azure's supported list of BCP-47 codes for translation.",
          "type": "STRING",
          "defaultValue": "en"
        },
        {
          "name": "FROM_LANGUAGE",
          "description": "Optional property that indicates the source BCP-47 language code of the text (i.e. 'es' to translate from text confirmed to be in Spanish). When provided, it disables automatic language detection. If the text isn't actually the specified FROM_LANGUAGE, the translation endpoint returns the text unmodified.  Please consult README to query Azure's supported list of BCP-47 codes for translation.",
          "type": "STRING",
          "defaultValue": ""
        },
        {
          "name": "SUGGESTED_FROM_LANGUAGE",
          "description": "Optional property that indicates the fallback source BCP-47 language code to use when automatic language detection fails (i.e. 'es' to translate text that is suspected to be in Spanish). The value from this property is only used when automatic language detection fails.  Please consult README to query Azure's supported list of BCP-47 codes for translation.",
          "type": "STRING",
          "defaultValue": ""
        },
        {
          "name": "CATEGORY",
          "description": "An optional property specifying the category (domain) of the translation. This parameter is used to get translations from a customized system built with Custom Translator.",
          "type": "STRING",
          "defaultValue": ""
        },
        {
          "name": "STRIP_NEW_LINE_BEHAVIOR",
          "description": "The translation endpoint treats newline characters as sentence boundaries. To prevent this newlines can be removed from the input text. Valid values are SPACE (replace with space character), REMOVE (remove newlines), NONE (leave newlines as they are), and GUESS (If source language is Chinese or Japanese use REMOVE, else use SPACE).",
          "type": "STRING",
          "defaultValue": "GUESS"
        },
        {
          "name": "DETECT_BEFORE_TRANSLATE",
          "description": "Use the /detect endpoint to check if translation can be skipped because the text is already in TO_LANGUAGE.",
          "type": "BOOLEAN",
          "defaultValue": "TRUE"
        },
        {
          "name": "LANGUAGE_FEED_FORWARD_PROP",
          "description": "Comma-separated list of property names indicating which properties in the feed-forward track or detection determine the language from which to translate. If the first property listed is present, then that property will be used. If it's not, then the next property in the list is considered. If none are present, fall back to FROM_LANGUAGE.",
          "type": "STRING",
          "defaultValue": "ISO_LANGUAGE,DECODED_LANGUAGE,LANGUAGE"
        },
        {
          "name": "SENTENCE_SPLITTER_CHAR_COUNT",
          "description": "Integer value specifying maximum number of characters to process through sentence splitter.",
          "type": "INT",
          "defaultValue": "500"
        },
        {
          "name": "SENTENCE_MODEL",
          "description": "Name of sentence segmentation model. Supported options are spaCy's multilingual `xx_sent_ud_sm` model and the Where's the Point (WtP) `wtp-bert-mini` model.",
          "type": "STRING",
          "defaultValue": "wtp-bert-mini"
        },
        {
          "name": "SENTENCE_MODEL_CPU_ONLY",
          "description": "If set to true, only use CPU resources for the sentence detection model. If set to False, allow sentence model to also use GPU resources (for Docker deployments, please consult README for more info).",
          "type": "BOOLEAN",
          "defaultValue": "TRUE"
        },
        {
          "name": "SENTENCE_MODEL_WTP_DEFAULT_ADAPTOR_LANGUAGE",
          "description": "More advanced WTP models will require a target language. This property sets the default language to use for sentence splitting, unless `FROM_LANGUAGE`, `SUGGESTED_FROM_LANGUAGE`, or Azure language detection return a different, WtP-supported language option.",
          "type": "STRING",
          "defaultValue": "en"
        },
        {
          "name": "SENTENCE_SPLITTER_INCLUDE_INPUT_LANG",
          "description": "Specifies whether to pass input language to sentence splitter algorithm. Currently, only WtP supports model adjustments by input language.",
          "type": "BOOLEAN",
          "defaultValue": "TRUE"
        }
      ]
    }
  },
  "actions": [
    {
      "name": "AZURE TRANSLATION (WITH FF REGION) ACTION",
      "description": "Uses Azure Cognitive Services to perform translation on feed-forward tracks and detections.",
      "algorithm": "AZURETRANSLATION",
      "properties": [
        {
          "name": "FEED_FORWARD_TYPE",
          "value": "REGION"
        },
        {
          "name": "IS_ANNOTATOR",
          "value": "TRUE"
        }
      ]
    },
    {
      "name": "AZURE TRANSLATION TEXT FILE ACTION",
      "description": "Uses Azure Cognitive Services to perform translation on a plain text file.",
      "algorithm": "AZURETRANSLATION",
      "properties": []
    }
  ],
  "tasks": [
    {
      "name": "AZURE TRANSLATION (WITH FF REGION) TASK",
      "description": "Uses Azure Cognitive Services to perform translation on feed-forward tracks and detections.",
      "actions": [
        "AZURE TRANSLATION (WITH FF REGION) ACTION"
      ]
    },
    {
      "name": "AZURE TRANSLATION TEXT FILE TASK",
      "description": "Uses Azure Cognitive Services to perform translation on a plain text file.",
      "actions": [
        "AZURE TRANSLATION TEXT FILE ACTION"
      ]
    }
  ],
  "pipelines": [
    {
      "name": "AZURE TRANSLATION TEXT FILE PIPELINE",
      "description": "Uses Azure Cognitive Services to perform translation on a plain text file.",
      "tasks": [
        "AZURE TRANSLATION TEXT FILE TASK"
      ]
    }
  ]
}