{
  "componentName": "EastTextDetection",
  "componentVersion": "6.3",
  "middlewareVersion": "6.3",
  "sourceLanguage": "python",
  "batchLibrary": "EastTextDetection",
  "environmentVariables": [],
  "algorithm": {
    "name": "EAST",
    "description": "EAST scene text detection.",
    "actionType": "DETECTION",
    "requiresCollection": {
      "states": []
    },
    "providesCollection": {
      "states": [
        "DETECTION",
        "DETECTION_TEXT_REGION",
        "DETECTION_TEXT_REGION_EAST"
      ],
      "properties": [
        {
          "name": "CONFIDENCE_THRESHOLD",
          "description": "Threshold value for filtering detections by bounding box confidence, between 0.0 and 1.0. Detections with scores lower than this value are dropped prior to non-maximum suppression.",
          "type": "FLOAT",
          "defaultValue": "0.8"
        },
        {
          "name": "MAX_SIDE_LENGTH",
          "description": "Maximum length (pixels) for one side of the image. Before being processed, the image will be resized such that the long edge is at most MAX_SIDE_LENGTH, while maintaining the same aspect ratio, and then further resized such that both dimensions are divisible by 32 (a requirement for EAST). Larger values improve recall, but cause significant slowdown. For unlimited input size, supply -1.",
          "type": "INT",
          "defaultValue": "-1"
        },
        {
          "name": "MERGE_OVERLAP_THRESHOLD",
          "description": "Threshold value used to determine whether to merge regions, between 0.0 and 1.0. When the ratio between the area of intersection of two regions and the area of the smaller region is greater than this value, the boxes may be merged.",
          "type": "FLOAT",
          "defaultValue": "0.0"
        },
        {
          "name": "NMS_MIN_OVERLAP",
          "description": "Threshold value used during non-maximum suppression, between 0.0 and 1.0, only used when MERGE_REGIONS is false. When the ratio between the areas of intersection and union between two regions is greater than or equal to this value, the lower-confidence detection will be dropped.",
          "type": "FLOAT",
          "defaultValue": "0.1"
        },
        {
          "name": "MERGE_MAX_TEXT_HEIGHT_DIFFERENCE",
          "description": "Threshold value used to determine whether to merge regions, between 0.0 and 1.0. When the relative difference in text height for two regions is less than or equal to this value, the boxes may be merged.",
          "type": "FLOAT",
          "defaultValue": "0.3"
        },
        {
          "name": "MERGE_MAX_ROTATION_DIFFERENCE",
          "description": "Threshold value used to determine whether to merge regions, between 0.0 and 180.0. When the absolute difference (in degrees) between the orientations of two regions is less than or equal to this value, the boxes may be merged.",
          "type": "FLOAT",
          "defaultValue": "10.0"
        },
        {
          "name": "TEMPORARY_PADDING_X",
          "description": "The temporary padding to add to the width of bounding boxes before non-maximum suppression or merging, in order to boost the overlap between adjacent detections. Each bounding box will be symmetrically padded on the left and right sides with space equal to TEMPORARY_PADDING_X * <box_height>. This padding does not persist after the NMS/merging step; use the FINAL_PADDING property to increase the size of output regions.",
          "type": "FLOAT",
          "defaultValue": "0.1"
        },
        {
          "name": "TEMPORARY_PADDING_Y",
          "description": "The temporary padding to add to the height bounding boxes before non-maximum suppression or merging, in order to boost the overlap between adjacent detections. Each bounding box will be symmetrically padded on the top and bottom with space equal to TEMPORARY_PADDING_Y * <box_height>. This padding does not persist after the NMS/merging step; use the FINAL_PADDING property to increase the size of output regions.",
          "type": "FLOAT",
          "defaultValue": "0.1"
        },
        {
          "name": "MIN_STRUCTURED_TEXT_THRESHOLD",
          "description": "Threshold value used to determine whether to text is considered to be structured or unstructured, between 0.0 and 1.0. Larger values will result in less text being marked as structured.",
          "type": "FLOAT",
          "defaultValue": "0.01"
        },
        {
          "name": "ROTATE_AND_DETECT",
          "description": "Whether to perform a second pass on the image after rotating 90 degrees. This can potentially pick up more text at high angles (larger than +/-60 degrees).",
          "type": "BOOLEAN",
          "defaultValue": "FALSE"
        },
        {
          "name": "MERGE_REGIONS",
          "description": "Whether to merge regions of text. If this is not TRUE, then non-max-suppression will instead be used to filter detections, and properties prefixed by MERGE_ will have no effect.",
          "type": "BOOLEAN",
          "defaultValue": "TRUE"
        },
        {
          "name": "SUPPRESS_VERTICAL",
          "description": "Whether to suppress vertical detections (those whose height is greater than width). This will dramatically improve performance when ROTATE_AND_DETECT is TRUE, but will usually stop the detection of vertical scripts.",
          "type": "BOOLEAN",
          "defaultValue": "TRUE"
        },
        {
          "name": "BATCH_SIZE",
          "description": "Number of frames to pass at a time when running on video.",
          "type": "INT",
          "defaultValue": "1"
        },
        {
          "name": "FINAL_PADDING",
          "description": "The padding to add around bounding boxes to ensure the text is fully enclosed. All bounding boxes will be symmetrically padded on all sides with space equal to PADDING * <box_height> after non-maximum suppression or merging.",
          "type": "FLOAT",
          "defaultValue": "0.0"
        }
      ]
    }
  },
  "actions": [
    {
      "name": "EAST TEXT DETECTION ACTION",
      "description": "Runs EAST text detection.",
      "algorithm": "EAST",
      "properties": []
    },
    {
      "name": "EAST TEXT DETECTION DERIVATIVE MEDIA ONLY ACTION",
      "description": "Runs EAST text detection on derivative media only.",
      "algorithm": "EAST",
      "properties": [
        {
          "name": "DERIVATIVE_MEDIA_ONLY",
          "value": "TRUE"
        }
      ]
    }
  ],
  "tasks": [
    {
      "name": "EAST TEXT DETECTION TASK",
      "description": "Runs EAST text detection.",
      "actions": [
        "EAST TEXT DETECTION ACTION"
      ]
    },
    {
      "name": "EAST TEXT DETECTION DERIVATIVE MEDIA ONLY TASK",
      "description": "Runs EAST text detection on derivative media only.",
      "actions": [
        "EAST TEXT DETECTION DERIVATIVE MEDIA ONLY ACTION"
      ]
    }
  ],
  "pipelines": [
    {
      "name": "EAST TEXT DETECTION PIPELINE",
      "description": "Runs EAST text detection.",
      "tasks": [
        "EAST TEXT DETECTION TASK"
      ]
    },
    {
      "name": "EAST TEXT DETECTION (WITH MARKUP) PIPELINE",
      "description": "Runs EAST text detection and performs markup.",
      "tasks": [
        "EAST TEXT DETECTION TASK",
        "OCV GENERIC MARKUP TASK"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION (WITH EAST REGIONS) PIPELINE",
      "description": "Performs Tesseract OCR on feed-forward regions from EAST.",
      "tasks": [
        "EAST TEXT DETECTION TASK",
        "TESSERACT OCR TEXT DETECTION (WITH FF REGION) TASK"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION (WITH EAST REGIONS AND MARKUP) PIPELINE",
      "description": "Performs Tesseract OCR on feed-forward regions from EAST and performs markup.",
      "tasks": [
        "EAST TEXT DETECTION TASK",
        "TESSERACT OCR TEXT DETECTION (WITH FF REGION) TASK",
        "OCV GENERIC MARKUP TASK"
      ]
    }
  ]
}
