{
  "componentName": "TesseractOCRTextDetection",
  "componentVersion": "6.2",
  "middlewareVersion": "6.2",
  "sourceLanguage": "c++",
  "batchLibrary": "${MPF_HOME}/plugins/TesseractOCRTextDetection/lib/libmpfTesseractOCRTextDetection.so",
  "environmentVariables": [
    {
      "name": "LD_LIBRARY_PATH",
      "value": "${MPF_HOME}/plugins/TesseractOCRTextDetection/lib:${LD_LIBRARY_PATH}",
      "sep": ":"
    }
  ],
  "algorithm": {
    "name": "TESSERACTOCR",
    "description": "Performs Tesseract optical character recognition.",
    "actionType": "DETECTION",
    "requiresCollection": {
      "states": []
    },
    "providesCollection": {
      "states": [
        "DETECTION",
        "DETECTION_TEXT",
        "DETECTION_TEXT_TESSERACT"
      ],
      "properties": [
        {
          "name": "CONFIDENCE_THRESHOLD",
          "description": "The minimum confidence score which must be met or exceeded. Detections below this threshold are silently discarded. Confidence value represents the average OCR confidence reported by Tesseract for a given TESSERACT_LANGUAGE setting. When PSM 0 (OSD only) is run, this value is set to default value of -1, as no OCR confidence score is available.",
          "type": "DOUBLE",
          "propertiesKey": "detection.confidence.threshold"
        },
        {
          "name": "MODELS_DIR_PATH",
          "description": "Path to models directory",
          "type": "STRING",
          "propertiesKey": "detection.models.dir.path"
        },
        {
          "name": "TESSDATA_MODELS_SUBDIRECTORY",
          "description": "Specifies location of tessdata models under the MODELS_DIR_PATH.",
          "type": "STRING",
          "defaultValue": "TesseractOCRTextDetection/tessdata"
        },
        {
          "name": "TESSERACT_LANGUAGE",
          "description": "The language or script OCR will be done in. Use '+' to run multiple languages together in one track and ',' to run them as separate tracks. Example: 'eng+deu+fra' = run English, German, French together as one track detection, 'eng, fra+deu'= run English as the first track and French + German as the second track, and 'fra, script/Latin'= run French as the first track, and Latin script as the second track. Language model files for Bulgarian (bul), Chinese - Simplified (chi_sim), German (deu), English (eng), French (fra), Pashto (pus), Russian (rus), and Spanish (spa) are stored in `$MPF_HOME/plugins/TesseractOCRTextDetection/tessdata`. Script model file for Latin(script/Latin) stored in `$MPF_HOME/plugins/TesseractOCRTextDetection/tessdata/script`. Note the osd language file (osd.traindata) is for extraction of script orientation rather than language. Users may download and load in additional language and script models from https://github.com/tesseract-ocr/tessdata.",
          "type": "STRING",
          "defaultValue": "script/Latin"
        },
        {
          "name": "TESSERACT_PSM",
          "description": "Tesseract Page Segmentation Mode. Refer to Tesseract docs (https://github.com/tesseract-ocr/tesseract/wiki/Command-Line-Usage) for details.",
          "type": "INT",
          "defaultValue": "3"
        },
        {
          "name": "TESSERACT_OEM",
          "description": "Tesseract OCR Engine Mode. Set to 0 for legacy engine only, 1 for LSTM engine only, 2 for both LSTM and legacy, and 3 for default (runs both engines at once if possible). Refer to Tesseract docs (https://github.com/tesseract-ocr/tesseract/wiki/Command-Line-Usage) for details.",
          "type": "INT",
          "defaultValue": "3"
        },
        {
          "name": "ENABLE_OSD_AUTOMATION",
          "description": "When enabled, automatically rotate image and set language based on detected orientation and script. Use default settings when orientation and script confidence values are low.",
          "type": "BOOLEAN",
          "defaultValue": "true"
        },
        {
          "name": "ENABLE_OSD_FALLBACK",
          "description": "When enabled, runs a second pass through OSD when the initial pass fails to produce a result or the best OSD score falls below the minimum specified threshold. OSD is then run on multiple copies of input text image to get an improved prediction score. The results are then kept depending on the minimum OSD threshold.",
          "type": "BOOLEAN",
          "defaultValue": "true"
        },
        {
          "name": "MAX_PARALLEL_SCRIPT_THREADS",
          "description": "When set to a value <= 1, OCR parallel processing is disabled. When set to a value > 1, OCR may be performed in parallel using up to the specified number of threads, where each thread is using a different script. Disabled during parallel processing of PDF pages.",
          "type": "INT",
          "defaultValue": "4"
        },
        {
          "name": "MAX_PARALLEL_PAGE_THREADS",
          "description": "When set to a value <= 1, PDF parallel page processing is disabled. When set to a value > 1, processing of pages may be performed in parallel using up to the specified number of threads, where each thread is processing OCR runs for a different page.",
          "type": "INT",
          "defaultValue": "4"
        },
        {
          "name": "COMBINE_OSD_SCRIPTS",
          "description": "When enabled, perform OCR on the combination of detected scripts. When disabled, perform OCR on each detected script independently.",
          "type": "BOOLEAN",
          "defaultValue": "true"
        },
        {
          "name": "MIN_OSD_TEXT_ORIENTATION_CONFIDENCE",
          "description": "Specifies the minimum confidence value (>= 0) required to use the detected text orientation when OSD automation is enabled. Top rotation confidence is calculated based on comparison of top-detected rotation score against secondary (lower confidence) rotation scores.",
          "type": "DOUBLE",
          "defaultValue": "2.0"
        },
        {
          "name": "MIN_OSD_PRIMARY_SCRIPT_CONFIDENCE",
          "description": "Specifies minimum confidence value (>= 0) required to use the top-detected script when OSD automation is enabled. Script confidence is calculated based on comparison of top-detected script score against the second-best script score.",
          "type": "DOUBLE",
          "defaultValue": "0.5"
        },
        {
          "name": "MIN_OSD_SCRIPT_SCORE",
          "description": "Specifies minimum required score (>= 0) to use the detected script when OSD automation is enabled. Unlike script confidence which only applies for the top-detected script, each secondary script processed during OSD also has its own script score. Thus, this threshold can be used to support multiple script detections.",
          "type": "DOUBLE",
          "defaultValue": "50.0"
        },
        {
          "name": "MIN_OSD_SECONDARY_SCRIPT_THRESHOLD",
          "description": "When running OSD automation, sets the min relative score threshold for running any secondary scripts. I.e. If set to 0.80, only scripts with raw scores that are at least 80% of the primary script score are allowed.",
          "type": "DOUBLE",
          "defaultValue": "0.80"
        },
        {
          "name": "MAX_OSD_SCRIPTS",
          "description": "Specifies maximum number of detected scripts by OSD. When set to 0 or below, allow any number of scripts with acceptable threshold scores.",
          "type": "INT",
          "defaultValue": "1"
        },
        {
          "name": "MAX_TEXT_TRACKS",
          "description": "Specifies number of reported text tracks per page based on average confidence scores. When set to 0 or below, allow any number of tracks.",
          "type": "INT",
          "defaultValue": "0"
        },
        {
          "name": "MAX_PIXELS",
          "description": "Specifies maximum pixel limit. Images that exceed this pixel limit will be rescaled to fit, if possible.  When set to 0 or below, allow images up to Teseract's internal limit of 32767 x 32767 pixels.",
          "type": "INT",
          "defaultValue": "10000000"
        },
        {
          "name": "MIN_HEIGHT",
          "description": "If set to a positive value, rescales all images to specified pixel height if smaller than provided limit, up to Tesseract's maximum image dimensions. Preserves image aspect ratio.",
          "type": "INT",
          "defaultValue": "60"
        },
        {
          "name": "INVALID_MIN_IMAGE_SIZE",
          "description": "If set to a positive value, rejects any image whose pixel height or width falls below this minimum threshold.",
          "type": "INT",
          "defaultValue": "3"
        },
        {
          "name": "INVERT",
          "description": "Toggles image color inversion during preprocessing for default, structured text images.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "ADAPTIVE_THRS_BLOCKSIZE",
          "description": "Specifies pixel radius for calculating adaptive threshold value for all images preprocessed under adaptive thresholding.",
          "type": "INT",
          "defaultValue": "51"
        },
        {
          "name": "ADAPTIVE_THRS_CONSTANT",
          "description": "Specifies constant subtracted from adaptive threshold mean.",
          "type": "DOUBLE",
          "defaultValue": "5"
        },
        {
          "name": "ADAPTIVE_HIST_TILE_SIZE",
          "description": "In adaptive histogram equalization, images are subdivided into tiles before histogram equalization is applied. This specifies the height and width of each image tile used for adaptive histogram equalization.",
          "type": "INT",
          "defaultValue": "5"
        },
        {
          "name": "ADAPTIVE_HIST_CLIP_LIMIT",
          "description": "Specifies clip limit parameter for adaptive histogram equalization. Higher values limits contrast amplification of images during histogram equalization, in order to reduce image noise.",
          "type": "DOUBLE",
          "defaultValue": "2.0"
        },
        {
          "name": "STRUCTURED_TEXT_ENABLE_OTSU_THRS",
          "description": "Enables Otsu image thresholding for default, structured text images. Adaptive_thrs overrides Otsu when both are enabled. Improves text extraction by converting image to black and white. Works best for images with uniform lighting. For multicolor images with gradients, use adaptive threshold. ",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "STRUCTURED_TEXT_ENABLE_ADAPTIVE_THRS",
          "description": "Enables adaptive image thresholding (overrides Otsu) for default, structured text images. Works better for images with lighting/color gradients.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "STRUCTURED_TEXT_ENABLE_ADAPTIVE_HIST_EQUALIZATION",
          "description": "Enables CLAHE (Contrast Limited Adaptive Histogram Equalization) preprocessing for default, structured text images. Applies histogram equalization locally across an image, with contrast limits and bilinear interpolation to reduce noise. Overrides basic histogram equalization when enabled.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "STRUCTURED_TEXT_ENABLE_HIST_EQUALIZATION",
          "description": "Enables histogram equalization as a preprocessing step for default, structured text images. Improves lighting and contrast for images with narrow pixel color ranges. Disabled when adaptive histogram equalization is enabled.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "STRUCTURED_TEXT_SHARPEN",
          "description": "Weight of the sharpening parameter for default images. Higher values increase sharpening while values close to 0 will return the original image. Set to a negative value to disable sharpening.",
          "type": "DOUBLE",
          "defaultValue": "-1.0"
        },
        {
          "name": "STRUCTURED_TEXT_SCALE",
          "description": "Image rescaling factor for default images, rescales up to Tesseract's maximum image dimensions. 1.0 = original image size, any value greater than 1.0 increases input size. Default optimal rescaling set to 1.6. Set to a negative value to disable rescaling.",
          "type": "DOUBLE",
          "defaultValue": "1.6"
        },
        {
          "name": "UNSTRUCTURED_TEXT_ENABLE_PREPROCESSING",
          "description": "Switch default image preprocessing behavior from STRUCTURED to UNSTRUCTRED image settings. Is overridden by image text type provided by feed-forward region TEXT_TYPE.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "UNSTRUCTURED_TEXT_ENABLE_OTSU_THRS",
          "description": "Enables Otsu image thresholding for wild images with text. Adaptive_thrs overrides Otsu when both are enabled. Improves text extraction by converting image to black and white. Works best for images with uniform lighting. For multicolor images with gradients, use adaptive threshold. ",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "UNSTRUCTURED_TEXT_ENABLE_ADAPTIVE_THRS",
          "description": "Enables adaptive image thresholding (overrides Otsu) for wild images with text. Works better for images with lighting/color gradients.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "UNSTRUCTURED_TEXT_ENABLE_ADAPTIVE_HIST_EQUALIZATION",
          "description": "Enables CLAHE (Contrast Limited Adaptive Histogram Equalization) preprocessing for wild images with text. Applies histogram equalization locally across an image, with contrast limits and bilinear interpolation to reduce noise. Overrides basic histogram equalization when enabled.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "UNSTRUCTURED_TEXT_ENABLE_HIST_EQUALIZATION",
          "description": "Enables histogram equalization as a preprocessing step for wild images with text. Improves lighting and contrast for images with narrow pixel color ranges. Disabled when adaptive histogram equalization is enabled.",
          "type": "BOOLEAN",
          "defaultValue": "false"
        },
        {
          "name": "UNSTRUCTURED_TEXT_SHARPEN",
          "description": "Weight of the sharpening parameter for wild images with text. Higher values increase sharpening while values close to 0 will return the original image. Set to a negative value to disable sharpening.",
          "type": "DOUBLE",
          "defaultValue": "1.0"
        },
        {
          "name": "UNSTRUCTURED_TEXT_SCALE",
          "description": "Image rescaling factor for wild images with text, rescales up to Tesseract's maximum image dimensions. 1.0 = original image size, any value greater than 1.0 increases input size. Default optimal rescaling set to 2.6. Set to a negative value to disable rescaling.",
          "type": "DOUBLE",
          "defaultValue": "2.6"
        },
        {
          "name": "ROTATE_AND_DETECT",
          "description": "When enabled, automatically perform OCR using detected orientation as well as a 180 degree rotation with an OCR confidence comparision to correctly parse upside down text.",
          "type": "BOOLEAN",
          "defaultValue": "true"
        },
        {
          "name": "ROTATE_AND_DETECT_MIN_OCR_CONFIDENCE",
          "description": "Specifies minimum text confidence required to skip second OCR pass with 180 degree rotation. Negative values will result in ROTATE_AND_DETECT performing two pass OCR regardless of text confidence from the initial pass.",
          "type": "DOUBLE",
          "defaultValue": "95.0"
        },
        {
          "name": "ROTATION_FILL_COLOR",
          "description": "The fill color to use when doing non-orthogonal rotation. Must either be BLACK or WHITE. When doing a non-orthogonal rotation, some pixels will need to be included that were not in the original image. This property controls the color of those undefined pixels.",
          "type": "STRING",
          "defaultValue": "WHITE"
        },
        {
          "name": "PASS_FEED_FORWARD_TEXT_TRACKS",
          "description": "When set to true, any feed-forward track for an with an existing TEXT property is returned without modification. Only applies to image and generic jobs.",
          "type": "BOOLEAN",
          "defaultValue": "true"
        }
      ]
    }
  },
  "actions": [
    {
      "name": "TESSERACT OCR TEXT DETECTION ACTION",
      "description": "Performs Tesseract OCR.",
      "algorithm": "TESSERACTOCR",
      "properties": []
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION SKIP TEXT TRACKS ACTION",
      "description": "Performs Tesseract OCR. Skips TEXT tracks.",
      "algorithm": "TESSERACTOCR",
      "properties": [
        {
          "name": "FEED_FORWARD_TYPE",
          "value": "FRAME"
        },
        {
          "name": "PASS_FEED_FORWARD_TEXT_TRACKS",
          "value": "true"
        }
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION ACTION SPARSE TEXT",
      "description": "Performs Tesseract OCR with page segmentation mode set to 11 (sparse text).",
      "algorithm": "TESSERACTOCR",
      "properties": [
        {
          "name": "TESSERACT_PSM",
          "value": "11"
        }
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION (WITH FF REGION) ACTION",
      "description": "Performs Tesseract OCR on feed-forward regions.",
      "algorithm": "TESSERACTOCR",
      "properties": [
        {
          "name": "FEED_FORWARD_TYPE",
          "value": "REGION"
        },
        {
          "name": "MIN_OSD_TEXT_ORIENTATION_CONFIDENCE",
          "value": "0"
        },
        {
          "name": "MIN_OSD_PRIMARY_SCRIPT_CONFIDENCE",
          "value": "0"
        },
        {
          "name": "MIN_OSD_SCRIPT_SCORE",
          "value": "0"
        },
        {
          "name": "MIN_OSD_SECONDARY_SCRIPT_THRESHOLD",
          "value": "0.40"
        },
        {
          "name": "MAX_OSD_SCRIPTS",
          "value": "2"
        },
        {
          "name": "UNSTRUCTURED_TEXT_SCALE",
          "value": "3.2"
        }
      ]
    }
  ],
  "tasks": [
    {
      "name": "TESSERACT OCR TEXT DETECTION TASK",
      "description": "Performs Tesseract OCR.",
      "actions": [
        "TESSERACT OCR TEXT DETECTION ACTION"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION SKIP TEXT TRACKS TASK",
      "description": "Performs Tesseract OCR, skips DERIVATIVE_MEDIA tracks.",
      "actions": [
        "TESSERACT OCR TEXT DETECTION SKIP TEXT TRACKS ACTION"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION TASK SPARSE TEXT",
      "description": "Performs Tesseract OCR with page segmentation mode set to 11 (sparse text).",
      "actions": [
        "TESSERACT OCR TEXT DETECTION ACTION SPARSE TEXT"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION (WITH FF REGION) TASK",
      "description": "Performs Tesseract OCR on feed-forward regions.",
      "actions": [
        "TESSERACT OCR TEXT DETECTION (WITH FF REGION) ACTION"
      ]
    }
  ],
  "pipelines": [
    {
      "name": "TESSERACT OCR TEXT DETECTION PIPELINE",
      "description": "Performs Tesseract OCR.",
      "tasks": [
        "TESSERACT OCR TEXT DETECTION TASK"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION PIPELINE SPARSE TEXT",
      "description": "Performs Tesseract OCR with page segmentation mode set to 11 (sparse text).",
      "tasks": [
        "TESSERACT OCR TEXT DETECTION TASK SPARSE TEXT"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION WITH KEYWORD TAGGING PIPELINE",
      "description": "Performs Tesseract OCR and keyword tagging.",
      "tasks" : [
        "TESSERACT OCR TEXT DETECTION TASK",
        "KEYWORD TAGGING (WITH FF REGION) TASK"
      ]
    },
    {
      "name": "TESSERACT OCR TEXT DETECTION WITH TRANSLATION TO ENGLISH PIPELINE",
      "description": "Performs Tesseract OCR and translation to English.",
      "tasks": [
        "TESSERACT OCR TEXT DETECTION TASK",
        "AZURE TRANSLATION (WITH FF REGION) TASK"
      ]
    }
  ]
}
